---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BeamFailures.CannotBendBeamType
source: html/a74af6c0-e194-b4aa-e191-58490f6de5d8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BeamFailures.CannotBendBeamType Property

Can't bend beam type "[Type Name]" along its location line. The beam is either too large or its curve is too sharp.
 You may be able to resolve the problem by reducing the beam's width in the bending direction, or by reducing acute angles in the curve.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotBendBeamType { get; }
```